<a href="https://colab.research.google.com/github/VeraMendes/DS-Unit-1-Sprint-1-Dealing-With-Data/blob/master/module2-loadingdata/Vera_Mendes_Practice_assignment_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

This coding challenge will walk you through the basics of Python 3 and Pandas library. 

Repl.it uses automatic unit tests to determine the correctness of your answer. On the left hand side you see the IDE and the console output windows. You execute your code by pressing the RUN button - you can do this as many times as you like. 

When you're ready, move on to the NEXT button to check your answers against the unit tests and submit your work for grading. Please make sure to submit your work (even if incomplete) before 8:45 PST so we can take attendance. Have fun!


Task 1: 
Your first task is to import the Pandas library, as we must install libraries (also called packages or modules) that support the functionality we need (in this case loading datasets in various formats). Remember the "iconic trio"?

Good detailed resource here: https://www.digitalocean.com/community/tutorials/how-to-import-modules-in-python-3


Task 2:
The second task is to load different file types for further processing and print out the first 5 rows. You will soon find that in data science, your datasets will come in various shapes and forms. Very frequently we use the .CSV (comma-separated values) format, however there are many others. 

Now let's test out loading and displaying a few different types in data. Load these three datasets and display the first five rows for each.

Hint: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html

Dataset 1: 
https://raw.githubusercontent.com/pierretd/datasets-1/master/BlackFriday.csv

Dataset 2: 
https://raw.githubusercontent.com/pierretd/datasets-1/master/PeopleInSpaceNow.json

Dataset 3: 
https://raw.githubusercontent.com/pierretd/datasets-1/master/FastFmProfiles.tsv


Stretch Goals: 
Load the Dataset 1 into a colab notebook and answer the following questions. When you are finished, add a link to your Colab notebook to the top of the code challenge as a comment.

1) Clean the data set and drop the Null/NaN values. Rename  Product_Category_1-3 columns with an actual Product. 

2) How many unique user_ids does the data set contain?

3) How many unique age brackets are in the dataset. Which Age bracket has the most entries? Which has the least?

4) Transform the Gender categorical variable into a numerical variable. Then transform that numerical value into a Boolean.

5)What is the average Occupation score? What is the Standard Deviation? What is the maximum and minimum value?

7) Group Age by Gender and print out a cross tab with age as the y axis


Super Stretch Goals: 
Build a linear regression model to predict the purchase amount given the other features in the data set with scikit learn. Try to get the best accuracy score using this metric: https://scikit-learn.org/stable/modules/generated/sklearn.metrics.accuracy_score.html

In [0]:
# Task 1 - Pandas Library Import here: 
import pandas as pd

In [0]:
from pandas import DataFrame
import numpy as np
import requests
import json

In [48]:
# Task 2 - Load three datasets and display 5 rows of data for each:

# df1 = dataframe1

df1 = pd.read_csv('https://raw.githubusercontent.com/pierretd/datasets-1/master/BlackFriday.csv')
df1.head()

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000001  P00069042      F  ...                NaN                 NaN     8370
1  1000001  P00248942      F  ...                6.0                14.0    15200
2  1000001  P00087842      F  ...                NaN                 NaN     1422
3  1000001  P00085442      F  ...               14.0                 NaN     1057
4  1000002  P00285442      M  ...                NaN                 NaN     7969

[5 rows x 12 columns]

In [42]:
url = 'https://raw.githubusercontent.com/pierretd/datasets-1/master/PeopleInSpaceNow.json'

# df2 = dataframe2

# another method I tried but could not organize data with it
# JSONContent = requests.get(url).json()
# df2 = json.dumps(JSONContent, indent = 1, sort_keys=True)
# print(df2)

data = pd.read_json(url)
df2 = pd.DataFrame(data)

df2.head()

                                              people  message  number
0       {'name': 'Sergey Prokopyev', 'craft': 'ISS'}  success       3
1        {'name': 'Alexander Gerst', 'craft': 'ISS'}  success       3
2  {'name': 'Serena Aunon-Chancellor', 'craft': '...  success       3

In [18]:
# df3 = dataframe3

df3= DataFrame.from_csv('https://raw.githubusercontent.com/pierretd/datasets-1/master/FastFmProfiles.tsv', sep='\t')
df3.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: FutureWarning: from_csv is deprecated. Please use read_csv(...) instead. Note that some of the default arguments are different, so please refer to the documentation for from_csv when changing your function calls
  This is separate from the ipykernel package so we can avoid doing imports until

            gender   age        country    registered
#id
user_000001      m   NaN          Japan  Aug 13, 2006
user_000002      f   NaN           Peru  Feb 24, 2006
user_000003      m  22.0  United States  Oct 30, 2005
user_000004      f   NaN            NaN  Apr 26, 2006
user_000005      m   NaN       Bulgaria  Jun 29, 2006

In [32]:
#Stretch Goal

# number1
# looking for NaN values 

df1.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

In [49]:
# df11 = df1.rename(columns={'Product_Category_1': 'Electronics', 'Product_Category_2': 'Groceries', 'Product_Category_3': 'Garden'}, inplace=True)

# df1 = df1.replace({"Product_Category_1": "Electronics"}, inplace = True)
# df1 = df1.replace({'Product_Category_2': 'Groceries'}, inplace = True)
# df1 = df1.replace({'Product_Category_3': 'Garden'}, inplace = True)



print(df1.shape)
df1.head()

(537577, 12)

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000001  P00069042      F  ...                NaN                 NaN     8370
1  1000001  P00248942      F  ...                6.0                14.0    15200
2  1000001  P00087842      F  ...                NaN                 NaN     1422
3  1000001  P00085442      F  ...               14.0                 NaN     1057
4  1000002  P00285442      M  ...                NaN                 NaN     7969

[5 rows x 12 columns]

In [34]:
from statistics import mean

df1.Product_Category_2.mean()

AttributeError: ignored

In [0]:
#Super Stretch Goal
##Your Code Here